# Question-1 Data Manipulation

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
  "Name": ["Laptop", "Laptop", "Ipad", "Ipad", "Tablet", "Laptop"],
  "Gender": ["Andrew", np.nan, "Tom", np.nan, "Tobey", "Peter"],
  "column_c": [1, np.nan, 2, np.nan, 1, 2],
})
df

     Name  Gender  column_c
0  Laptop  Andrew       1.0
1  Laptop     NaN       NaN
2    Ipad     Tom       2.0
3    Ipad     NaN       NaN
4  Tablet   Tobey       1.0
5  Laptop   Peter       2.0

# Option-1
 df['Gender'].isna().sum() gives the number of null values in the column "Gender".

In [4]:
df['Gender'].isna().sum()

2

# Option-2
 df.isna().sum().sum() gives the total number of null values in the dataframe.

In [6]:
df.isna().sum().sum()

4

# Option-3
df.loc[[3]].isna().sum().sum() gives the number of null values in the 4th row.

In [10]:
df.loc[[3]].isna().sum()

Name        0
Gender      1
column_c    1
dtype: int64

In [11]:
df.loc[[3]].isna().sum().sum()

2

# Option-4
 df.dropna(axis=1, how='all') and df.dropna(axis=1, how='any') are the methods to drop the columns having all or at least one of the values==Nan respectively.

In [12]:
df

     Name  Gender  column_c
0  Laptop  Andrew       1.0
1  Laptop     NaN       NaN
2    Ipad     Tom       2.0
3    Ipad     NaN       NaN
4  Tablet   Tobey       1.0
5  Laptop   Peter       2.0

In [3]:
df.dropna(axis=1, how='all') and df.dropna(axis=1, how='any')

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [20]:
df.dropna(axis=0, how='all')

     Name  Gender  column_c
0  Laptop  Andrew       1.0
1  Laptop     NaN       NaN
2    Ipad     Tom       2.0
3    Ipad     NaN       NaN
4  Tablet   Tobey       1.0
5  Laptop   Peter       2.0

In [23]:
df.dropna(axis=1, how='any') # Drops Column

     Name
0  Laptop
1  Laptop
2    Ipad
3    Ipad
4  Tablet
5  Laptop

In [22]:
df.dropna(axis=0, how='any') # Drops Rows

     Name  Gender  column_c
0  Laptop  Andrew       1.0
2    Ipad     Tom       2.0
4  Tablet   Tobey       1.0
5  Laptop   Peter       2.0

# Option-5
df.fillna(value=replacement)will fill all the Nan values according to key, value pairs of replacement= {'Name': 0, 'Gender': 'unknown', 'column_c': -99999} where 'Name', 'Gender', and 'column_c' are the column names.

In [15]:
replacement= {'Name': 0, 'Gender': 'unknown', 'column_c': -99999}

In [16]:
df.fillna(value=replacement)

     Name   Gender  column_c
0  Laptop   Andrew       1.0
1  Laptop  unknown  -99999.0
2    Ipad      Tom       2.0
3    Ipad  unknown  -99999.0
4  Tablet    Tobey       1.0
5  Laptop    Peter       2.0